const MakersEdveData = [
  {
    number: "01",
    info: "4 года на рынке ",
  },
  {
    number: "02",
    info: "Подготовили +1150 программистов",
  },
  {
    number: "03",
    info: "Сотрудничество с +35 компаниями",
  },
  {
    number: "04",
    info: "Сертификация  учеников",
  },
  {
    number: "05",
    info: "Помощь менеджера в продвижении ",
  },
  {
    number: "06",
    info: "Практика на реальных проектах",
  },
  {
    number: "07",
    info: "Запустили Грант на 1 000 000 сом на обучение",
  },
];
export default MakersEdveData;
