
const CardsData = [ 
  {
    name: "Веб дизайн в Figma,основы UX/UI",
    duration: "Продолжительность курса: 1 месяц",
    lesson: "12 видеолекций",
    price: "Бесплатно",
  },
  {
    name: "Полный курс по JavaScript",
    duration: "Продолжительность курса: 2 месяц",
    lesson: "20 видеолекций",
    price: "Бесплатно",
  },
  {
    name: "Теория дизайна для веб дизайнеров",
    duration: "Продолжительность курса: 1 месяц",
    lesson: "8 видеолекций",
    price: "Бесплатно",
  },
  {
    name: "Spring для начинающих",
    duration: "Продолжительность курса: 1 месяца",
    lesson: "12 видеолекций",
    price: "Бесплатно",
  },

  {
    name: "Курс по Adobe Photoshop",
    duration: "Продолжительность курса: 2 месяц",
    lesson: "12 видеолекций",
    price: "25 000 сом",
  },
  {
    name: "Веб дизайн в Figma. Создание Ui Kit",
    duration: "Продолжительность курса: 2 месяц",
    lesson: "12 видеолекций",
    price: "15 000 сом",
  },
  {
    name: "Python разработка",
    duration: "Продолжительность курса: 2 месяц",
    lesson: "12 видеолекций",
    price: "25 000 сом",
  },
  {
    name: "Современный JavaScript",
    duration: "Продолжительность курса: 2 месяц",
    lesson: "12 видеолекций",
    price: "25 000 сом",
  },
  {
    name: "Веб дизайн в Figma. Создание Ui Kit",
    duration: "Продолжительность курса: 2 месяц",
    lesson: "12 видеолекций",
    price: "15 000 сом",
  },
  {
    name: "Веб дизайн в Figma. Создание Ui Kit",
    duration: "Продолжительность курса: 2 месяц",
    lesson: "12 видеолекций",
    price: "15 000 сом",
  },
  {
    name: "Веб дизайн в Figma. Создание Ui Kit",
    duration: "Продолжительность курса: 2 месяц",
    lesson: "12 видеолекций",
    price: "15 000 сом",
  },
];
export default CardsData;
