import React from "react";

const Card = () => {
  return (
    <div>
      <h2>Курс по Adobe Photoshop</h2>
      <ul>
        <li>
          Вы изучите лучшие и самые современные техники по выделения объектов.
        </li>
        <li> Вы начнете использовать в работе Гистограмму и круг HSL.</li>
        <li>
          Вы начнете разбираться в тонкостях настройки программы Photoshop
        </li>
        <li>Вы научитесь монтировать видео ролики прямо в photoshop</li>
        <li>Вы узнаете что такое синемаграфия и параллакс эффект</li>
        <li>Вы создадите более 7 новых работ для вашего портфолио.</li>
      </ul>
      <h3>Продолжительность курса: 2 месяца</h3>
      <h3>12 видеолекций</h3>
      <div>
        <p>25 000 сом </p>
        <span></span>
      </div>
    </div>
  );
};

export default Card;
