import i18n from 'i18next';
import Backend from 'i18next-http-backend';
import LanguageDetector from 'i18next-browser-languagedetector';
import { initReactI18next } from 'react-i18next';

i18n
  .use(Backend)
  .use(LanguageDetector)
  .use(initReactI18next)
  .init({
    resources: {
      ru: {
        translation: {
          "to_come_in": "Войти",
          "to":"Войти как гость",
          "register" : "Зарегестрироваться",
          "or" : "или",
          "google" : "Войти через Google",
          "forgot_password" : 'Забыл пароль',
          "reset_the_password" : "Сбросить пароль",
          "Remembered_the_password" : "Вспомнил пароль",
          "Repeat_password" : "Повторите пароль",
          "continue" : "Продолжить",
          "to_your": "На вашу",
          "email_sent_link" : "почту отправлена ссылка",
          "to_reset_your_password" : "для сброса пароля",
          "confirm_mail" : "Подтвердите почту, чтобы активировать аккаунт",
          "if_the_letter_did_not_arrive" : ' Если письмо не пришло, проверьте папку "спам" или',
          "repeat_activation" : "повторите активацию",
          "city_of_residence" : "Город проживания",
          "school_name" : "Название школы",
          "school_number" : "Номер школы",
          "class_number" : "Номер класса",
          "entrance" : "Вход",
          "forgot_address" : " Забыли адрес эл. почты?",
          "app_makers" : " Приложению “Makers” будет предоставлен доступ к вашим данным: имени,адресу электронной почты, языковым настройкам и фото профиля. Прежде чем начать работу с приложением “Makers”, вы можете ознакомиться с его",
          "policy" : " политикой конфиденциальности и условиями использования.",
          "create_an_account" : "Создать аккаунт",


          "adobe_photoshop" : "Курс по Adobe Photoshop",
          "adobe_photoshop-1" : "Вы изучите лучшие и самые современные техники по выделения объектов.",
          "adobe_photoshop-2" : "Вы начнете использовать в работе Гистограмму и круг HSL.",
          "adobe_photoshop-3" : "Вы начнете разбираться в тонкостях настройки программы Photoshop",
          "adobe_photoshop-4" : "Вы научитесь монтировать видео ролики прямо в photoshop",
          "adobe_photoshop-5" : "Вы узнаете что такое синемаграфия и параллакс эффект",
          "adobe_photoshop-6" : "Вы создадите более 7 новых работ для вашего портфолио.",
          "adobe_photoshop-7" : "Продолжительность курса: 2 месяца",
          "adobe_photoshop-8" : "12 видеолекций",
          "adobe_photoshop-9" : "25 000 сом",
          
          //! app main page
          "macbook" : "Купи Macbook своей мечты ",
          "macbook_2" : "Приходи к нам в Istore.kg",
          "free_courses" : "Бесплатные курсы",
          "Paid_courses " : "Платные курсы",
          "contact" : "Связаться ",
          "send" : "Отправить",
          "personal_area" : "Личный кабинет",
          "favorites" : "Избранное", 
          "test" : "Тест" ,
          "help" : "Помощь",
          "home" : "Главная",
          "Course_schedule" : "Расписание курсов",
          "video_player" : "Видео плеер",
          "go_out" : "Выйти",

          "personal_data" : "Персональные данные",
          "my_courses" : "Мои курсы",
          "test_results" : "Результаты тестов",

          "ui_kit" : "Веб дизайн в Figma. Создание Ui Kit",
          "kit-1" : "Изучение всех инструментов Figma",
          "kit-2" : "Углубленное изучение Figma",
          "kit-3" : "Практика работы в Figma",
          "kit-4" : "Углубленная работа со сложными компонентами",
          "kit-5" : "Продумывание архитектуры проекта",
          "kit-6" : "Создание реального продукта Ui Kit",
          "kit-7" : "Работа с плагинами",
          "kit-8" : "Работа с hot key",





          "desktopTwo-1" : "Курсы",
          "desktopTwo-2" : "Расписание",
          "desktopTwo-3" : "Поиск",
          "desktopTwo-4" : "Связаться",
          "desktopTwo-5" : "С нами ты легко устроишься ",
          "desktopTwo-6" : "на любимой работу!",
          "desktopTwo-7" : "Оставь заявку на бесплатную консультацию и мы",
          "desktopTwo-8" : "обязательно свяжемся с тобой",
          "desktopTwo-9" : "Нажимая кнопку «Отправить», я даю согласие",
          "desktopTwo-10" : "на обработку своих персональных данных",
          "desktopTwo-11" : "Имя",
          "number" : "Номер телефона",


          // ! Partners
          "partners" : "Наши партнеры",

          // !Container
          "container" : "4 года на рынке",
          "container_1" : "Подготовили +1150 программистов",
          "container_2" : "Сотрудничество с +35 компаниями",
          "container_3" : "Сертификация  учеников",
          "container_4" : "Помощь менеджера в продвижении ",
          "container_5" : "Практика на реальных проектах",
          "container_6" : "Запустили Грант на 1 000 000 сом на обучение",



// ! Веб дизайн в Figma,основы UX/UI

"ux_ui" : "Веб дизайн в Figma,основы UX/UI",
          "ux_ui_1" : "Подготовили +1150 программистов",
          "ux_ui_2" : "12 видеолекций",
          "ux_ui_3" : "Бесплатно",


// ! Теория дизайна -для веб дизайнеров

          "veb" : "Теория дизайна -для веб дизайнеров",
          "veb_1" : "Продолжительность курса: 1 месяц",
          "veb_2" : "8 видеолекций",

          
// ! Python разработка

          "python" : "Python разработка",
          "python_1" : "Форматирование строк",
          "python_2" : "Lists, Dictionaries, Tuples, Sets",
          "python_3" : " List, Dictionary and Set Comprehension",
          "python_4" : "Вложенные циклы",
          "python_5" : "*args. **kwargs.",
          "python_6" : "Method Resolution Order (MRO)",
          "python_7" : "Модули и пакеты",


// !  Полный курс по JavaScript
          "javaScript" : "Полный курс по JavaScript",

// ! Spring для начинающих
          "spring" : "Spring для начинающих",


// ! Современный JavaScript

          "js" : "Современный JavaScript",
          "js_1" : "Изучим асинхронный JavaScript а именно Event Loop, AJAX, Promises,",
          "js_2" : "Async/Await",
          "js_3" : "Научимся работать со сторонним API",
          "js_4" : "Напишем несколько проектов с использованием ES6+",
          "js_5" : "Изучим новые фичи стандарта ES6+",
          "js_6" : "Научимся организовывать и структурировать код",
          "js_7" : "Бонус. Разбор задач с собеседований и как начать работать на фрилансе.",
          
        
// ! Освой профессию Backend разработчика
 "bk" : "Освой профессию Backend разработчика",


//  ! HTML & CSS
          "html" : "HTML & CSS",


// ! Освой профессию Frontend разработчика

          "fn" : "Освой профессию Frontend разработчика",

// ! Основы компьютерной грамотности
         
          "comp" : "Основы компьютерной грамотности",


// ! Полный курс по Linkedin

          "linkedin" : "Полный курс по Linkedin",
          "linkedin_1" : "Как использовать Linkedin для поиска работы заграницей ",
          "linkedin_2" : "Как создать крутой Linkedin профиль для поиска работы ",
          "linkedin_3" : "Как сделать так, что бы рекрутеры сами к вам обращались на Linkedin",
          "linkedin_4" : "Как с помощью Linkedin получить приглашение на интервью",
       "linkedin_5" : "10 видеолекций",

// ! Тестировщик с нуля 2023. Web/Mobile, Postman, SQL, Git, Bash
       
          "sol" : "Тестировщик с нуля 2023. Web/Mobile,",
          "sol_1" : "Postman, SQL, Git, Bash",
          "sol_2" : "Теория тестирования ПО",
          "sol_3" : "Практика тестирования ПО",
          "sol_4" : "Тестирование мобильных и веб-приложений, базы данных",
          "sol_5" : "Тестирование API",
          "sol_6" : "Работа с Postman",
          "sol_7" : "18 видеолекций",

// ! Креативность для всех

        "all" : "Креативность для всех",
        "all_1" : "проводить качественные исследования",
        "all_2" : "определять свободные ниши на рынке",
        "all_3" : "составлять “карты эмпатии”",
        "all_4" : "превращать проблемы в возможности",
        "all_5" : "генерировать идеи и проводить брейнштормы",
        "all_6" : "ридумывать идеи для стартапа или расширения существующего бизнеса",
       
        
 // ! Краш-курс по Продуктивности и Личной Эффективности
        
        "effect" : "Краш-курс по Продуктивности и ",
        "effect_1" : "Как Увеличить Свою Производительность",
        "effect_2" : "Как Чувствовать Себя Более Энергичным в Течение Дня ",
        "effect_3" : "Как Выполнять Больше Задач",
        "effect_4" : "Производительности",
        "effect_5" : "5 видеолекций",

// ! К сожалению на данный момент нет набора на курс по вашим запросам

          "content" : "К сожалению на данный момент",
          "content_1" : "нет набора на курс по вашим",
          "content_2" : "запросам",

// ! Мы можем помочь выбрать подходящий тебе курс!

          "content_3" : "Мы можем помочь ",
          "content_4" : "выбрать подходящий ",
          "content_5" : "тебе курс!",

// ! поиск

          "form" : "Формат",
          "form_1" : "Онлайн курсы",
          "form_2" : "Оффлайн курсы",
          "form_3" : "Стоимость",
          "form_4" : "до 10 000 сом",
          "form_5" : "до 15 0000 сом",
          "form_6" : "Свыше 15 000 сом",
          "form_7" : "Сбросить фильтры",
          
// ! Выход
          "exit" : "Вы точно хотите выйти из приложения?",
          "yes" : "Да",
          "no" : "Нет",

// ! Помощь

          "hepl_1" : "Если вам нужна помощь в работе с приложением обучающей платформы( регистрации, изменение данных, и др.), свяжитесь с нами по эл. почте support@makers.kg",
          "help_2" : "Если вам нужна помощь в организации учебного процесса свяжитесь с нами по эл. почте education@makers.kg",
         
// ! нет курса по запросу 
        
          "request" : "К сожалению на данный ",
          "request_1" : "момент нет набора на",
          "request_2" : "курс по вашим запросам",
          "request_3" : "Мы можем помочь выбрать",
          "request_4" : "подходящий тебе курс!",
          
"my" : "Мы можем помочь",
"my_1" : "выбрать подходящий",
"my_2" : "тебе курс!",

          

// ???????????????????????????????????????????????????


        },
      },
      kg: {
        translation: {
          "to_come_in": "Кируу",
          "to": "Конок катары кириңиз",
          "register" : "Каттоо",
          "or" : "же",
          "google" : 'Google аркылуу кируу',
          "forgot_password" : 'Паролду унутуп калдыңыз',
          "reset_the_password" : "Сырсөздү кайра коюу",
          "Remembered_the_password" : "Сырсөздү эстеди",
          "Repeat_password" : "Сырсөздү кайталаңыз",
           "continue" : "Улантуу",
           "to_your": "Сиздин почтаңызга",
           "email_sent_link" : "сырсөздү калыбына келтирүү ",
           "to_reset_your_password" : "шилтемеси жөнөтүлдү",
           "confirm_mail" : "Каттоо эсебиңизди активдештирүү үчүн электрондук почтаңызды ырастаңыз",
           "if_the_letter_did_not_arrive" : ' Эгер сиз электрондук кат албасаңыз, спам папкаңызды текшериңиз же',
           "repeat_activation" : "кайра активдештирип көрүңүз.",
           "city_of_residence" : "Шаар же жашаган мамлекет",
           "school_name" : "Мектептин аты",
           "school_number" : "Мектептин номери ",
           "class_number" : "Класстын номери ",
           "entrance" : "Чыгуу",
           "forgot_address" : "Эл.почта дарегин унутуп калдым?",
           "app_makers" : " “Makers” колдонмосуна маалыматтарыңызга мүмкүнчүлүк берилет: аты-жөнү, электрондук почта дареги, тил жөндөөлөрү жана профиль сүрөтү. “Makers” колдонмосун баштоодон мурун, аны менен таанышып чыксаңыз болот",
           "policy" : "купуялык саясаты жана пайдалануу шарттары.",
           "create_an_account" : "Эсеп түзүү",

           "adobe_photoshop" : "Курс по Adobe Photoshop",
           "adobe_photoshop-1" : "Сиз объекттерди тандоонун эң мыкты жана заманбап ыкмаларын үйрөнөсүз.",
           "adobe_photoshop-2" : "Сиз гистограмманы жана HSL Circle колдоно баштайсыз.",
           "adobe_photoshop-3" : "Сиз Photoshop орнотуунун татаалдыктарын түшүнө баштайсыз.",
           "adobe_photoshop-4" : "Сиз Photoshop программасында видеоклиптерди кантип орнотууну үйрөнөсүз",
           "adobe_photoshop-5" : "Сиз кинематография жана параллакс эффектиси эмне экенин билесиз",
           "adobe_photoshop-6" : "Сиз портфолиоңуз үчүн 7ден ашык жаңы чыгармаларды жаратасыз.",
           "adobe_photoshop-7" : "Продолжительность курса: 2 месяца",
           "adobe_photoshop-8" : "12 видеолекций",
           "adobe_photoshop-9" : "25 000 сом",

            // app main page
          "macbook" : "Кыялыңыздагы Macbook сатып алыңыз Istore.kg сайтына келиңиз",
          "free_courses" : "Акысыз курстар",
          "Paid_courses " : "Акы төлөнүүчү курстар",
          "contact" : "Байланыш",
          "send" : "Жөнөтүү",

          "personal_area" : "Жеке бөлмө",
          "favorites" : "Сүйүктүүлөр", 
          "test" : "Тест" ,
          "help" : "Жардам",
          "home" : "үй",
          "Course_schedule" : "Акы төлөнүүчү курстар",
          "video_player" : "Курстун тартиби",
          "go_out" : "Чыгуу",

          "personal_data" : "Жеке маалыматтар",
          "my_courses" : "Менин курстарым",
          "test_results" : "Тесттин жыйынтыгы",


          "ui_kit" : "Веб дизайн в Figma. Создание Ui Kit",
          "kit-1" : "Бардык Figma куралдарын изилдөө",
          "kit-2" : "Углубленное изучение Figma",
          "kit-3" : "Практика работы в Figma",
          "kit-4" : "Углубленная работа со сложными компонентами",
          "kit-5" : "Продумывание архитектуры проекта",
          "kit-6" : "Создание реального продукта Ui Kit",
          "kit-7" : "Работа с плагинами",
          "kit-8" : "Работа с hot key",



          "desktopTwo-1" : "Курстар",


          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          "" : "",
          
          "desktopTwo-2" : "График",
          "desktopTwo-3" : "Издөө",
          "desktopTwo-4" : "Байланыш",
          "desktopTwo-5" : "Биз менен сиз оңой эле чече аласыз",
          "desktopTwo-6" : "сүйүктүү жумушуңузга!",
          "desktopTwo-7" : "Акысыз консультация алуу үчүн арыз калтырыңыз жана биз",
          "desktopTwo-8" : "биз сиз менен сөзсүз байланышабыз",
          "desktopTwo-9" : "«Тапшыруу», баскычын басуу менен мен макулмун",
          "desktopTwo-10" : "сиздин жеке маалыматтарыңызды иштетүүгө",
          "desktopTwo-11" : "Аты",
          "number" : "Телефон номуру",


          // ! Partners
          "partners" : "Биздин өнөктөштөр",

          // !Container
          "container" : "Базарда 4 жыл",
          "container_1" : "+1150 программист даярдалган",
          "container_2" : "+35 компания менен кызматташуу",
          "container_3" : "Студенттик аттестация",
          "container_4" : "Менеджерге көмөк көрсөтүү",
          "container_5" : "Чыныгы долбоорлор боюнча машыгыңыз",
          "container_6" : "Биз окутуу үчүн 1 000 000 сомго Грантты баштадык",



// ! Веб дизайн в Figma,основы UX/UI

"ux_ui" : "Figmaдагы веб-дизайн, UX/UI негиздери",
          "ux_ui_1" : "+1150 программист даярдалган",
          "ux_ui_2" : "12 видеолекция",
          "ux_ui_3" : "Акысыз",


// ! Теория дизайна -для веб дизайнеров

          "veb" : "Дизайн теориясы - веб дизайнерлер үчүн",
          "veb_1" : "Курстун узактыгы: 1 ай",
          "veb_2" : "8 видеолекция",

          
// ! Python разработка

          "python" : "Python өнүктүрүү",
          "python_1" : "Сапты форматтоо",
          "python_2" : "Тизмелер, сөздүктөр, кортеждер, топтомдор",
          "python_3" : "Тизме, Сөздүк жана Set түшүнүү",
          "python_4" : "Insted Loops",
          "python_5" : "*args. **kwargs.",
          "python_6" : "Методду чечүү тартиби (MRO)",
          "python_7" : "Модульдер жана пакеттер",


// !  Полный курс по JavaScript
          "javaScript" : "Толук JavaScript курсу",

// ! Spring для начинающих
          "spring" : "Жаңы баштагандар үчүн жаз",


// ! Современный JavaScript

          "js" : "Заманбап JavaScript",
          "js_1" : "Келгиле, асинхрондук JavaScriptти үйрөнөлү, атап айтканда Event Loop, AJAX, Promises,",
          "js_2" : "Async/Await",
          "js_3" : "Үчүнчү тараптын API менен иштөөнү үйрөнүңүз",
          "js_4" : "Келгиле, ES6+ менен кээ бир долбоорлорду жазалы",
          "js_5" : "ES6+ стандартынын жаңы мүмкүнчүлүктөрүн изилдеп көрөлү",
          "js_6" : "Кодду кантип уюштурууну жана түзүүнү үйрөнүңүз",
          "js_7" : "Бонус. Интервьюлардан алынган тапшырмаларды талдоо жана фрилансерди кантип баштоо керек.",
          
        
// ! Освой профессию Backend разработчика
 "bk" : "Backend иштеп чыгуучусу болуңуз",


//  ! HTML & CSS
          "html" : "HTML & CSS",


// ! Освой профессию Frontend разработчика

          "fn" : "Frontend Developer болуңуз",

// ! Основы компьютерной грамотности
         
          "comp" : "Компьютердик сабаттуулуктун негиздери",


// ! Полный курс по Linkedin

          "linkedin" : "Linkedin боюнча толук курс",
          "linkedin_1" : "Чет өлкөдө жумуш табуу үчүн Linkedin кантип колдонсо болот",
          "linkedin_2" : "Кантип сонун Linkedin жумуш издөө профилин түзүү керек",
          "linkedin_3" : "Linkedin'де сиз менен байланышуу үчүн жалдоочуларды кантип алса болот",
          "linkedin_4" : "Linkedin аркылуу интервью чакыруусун кантип алса болот",
       "linkedin_5" : "10 видеолекция",

// ! Тестировщик с нуля 2023. Web/Mobile, Postman, SQL, Git, Bash
       
          "sol" : "Сыноочу нөлдөн баштап 2023. Веб/Мобилдик,",
          "sol_1" : "Postman, SQL, Git, Bash",
          "sol_2" : "Программалык камсыздоону сыноо теориясы",
          "sol_3" : "Программалык камсыздоону сыноо практикасы",
          "sol_4" : "Мобилдик жана веб-тиркемелерди, маалымат базаларын тестирлөө",
          "sol_5" : "API тести",
          "sol_6" : "Почтачы менен иштөө",
          "sol_7" : "18 видеолекция",

// ! Креативность для всех

        "all" : "Баары үчүн чыгармачылык",
        "all_1" : "сапаттуу изилдөөлөрдү жүргүзүү",
        "all_2" : "рыногунда бош орундарды аныктоо",
        "all_3" : "“эмпатия карталарын” түзүү",
        "all_4" : "көйгөйлөрдү мүмкүнчүлүккө айлантуу",
        "all_5" : "идеяларды жаратып, мээ чабуулдарын өткөрөт",
        "all_6" : "иштеп жаткан бизнести баштоо же кеңейтүү үчүн идеяларды ойлоп табыңыз",
       
        
 // ! Краш-курс по Продуктивности и Личной Эффективности
        
        "effect" : "Өндүрүмдүүлүк боюнча Crash Course and",
        "effect_1" : "Өндүрүмдүүлүгүңүздү кантип жогорулатуу керек",
        "effect_2" : "Кантип күн ичинде көбүрөөк энергияны сезсе болот",
        "effect_3" : "Кантип көбүрөөк тапшырмаларды аткаруу керек",
        "effect_4" : "Производительности",
        "effect_5" : "5 видеолекция",

// ! К сожалению на данный момент нет набора на курс по вашим запросам

          "content" : "Тилекке каршы азыркы учурда",
          "content_1" : "сиздин каалооңуз боюнча курска жазылуу жок",
          "content_2" : "өтүнүчтөр",

// ! Мы можем помочь выбрать подходящий тебе курс!

          "content_3" : "Биз жардам бере алабыз",
          "content_4" : "туурасын танда",
          "content_5" : "албетте силер үчүн!",

// ! поиск

          "form" : "Формат",
          "form_1" : "Онлайн курстар",
          "form_2" : "Оффлайн курстары",
          "form_3" : "Баасы",
          "form_4" : "10 000 сомго чейин",
          "form_5" : "15 000 сомго чейин",
          "form_6" : "15 000 сомдон жогору",
          "form_7" : "Чыпкаларды баштапкы абалга келтирүү",
          
// ! Выход
          "exit" : "Колдонмодон чын эле чыккыңыз келеби?",
          "yes" : "Ооба",
          "no" : "Жок",

// ! Помощь

          "hepl_1" : "Эгер сизге окуу платформасынын тиркемесинде жардам керек болсо (каттоо, маалыматтарды өзгөртүү, ж.б.), электрондук почта аркылуу биз менен байланышыңыз. support@makers.kg дарегине кайрылыңыз",
          "help_2" : "Эгерде сизге окуу процессин уюштурууда жардам керек болсо, биз менен электрондук почта аркылуу байланышыңыз. education@makers.kg дарегине кайрылыңыз",
         
// ! нет курса по запросу 
        
          "request" : "Тилекке каршы бул боюнча",
          "request_1" : "көз ирмем жок",
          "request_2" : "албетте сиздин муктаждыктарыңызга жараша",
          "request_3" : "Биз сизге тандоого жардам бере алабыз",
          "request_4" : "сен үчүн туура курс!",

        },
      },
    },
    fallbackLng: 'ru', 
    interpolation: {
      escapeValue: false,
    },
    detection: {
      order: ["cookie", "localStorage"],
      caches: ["cookie"]
    },
    debug: true,
  });

export default i18n;
